cases/artigo_mestrado/old/on-fsi-2-Pc18068/fluid/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
5760
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    fsi_pia
    {
        type            calculated;
        value           nonuniform List<scalar> 
960
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;
    }
    fsi_dura
    {
        type            calculated;
        value           nonuniform List<scalar> 
960
(
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
0.0005
...
)
;
    }
    fsi_sclera_peri
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
0.03
0.03
0.03
0.03
0.03
0.03
0.03
0.03
...
)
;
    }
    fsi_sclera_ring
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
0.03
0.03
0.03
0.03
0.03
0.03
0.03
0.03
...
)
;
    }
}


// ************************************************************************* //
